app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'randhir@betasoftsystems.com' LIMIT 1
SELECT "ip_addresses".* FROM "ip_addresses" WHERE "ip_addresses"."address" IS NULL LIMIT 1
INSERT INTO "ip_addresses" ("address", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", nil], ["count", 0], ["created_at", Thu, 05 Nov 2015 23:00:40 UTC +00:00], ["updated_at", Thu, 05 Nov 2015 23:00:40 UTC +00:00]]
UPDATE "ip_addresses" SET "count" = 1, "updated_at" = '2015-11-05 23:00:40.683902' WHERE "ip_addresses"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."referral_code" = '2c33b702b6' LIMIT 1
INSERT INTO "users" ("created_at", "email", "referral_code", "referrer_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "refers".* FROM "refers" WHERE "refers"."refer_by" = 25
SELECT "refers".* FROM "refers" WHERE "refers"."userid" = 34
---
    def create
        # Get user to see if they have already signed up
        @user = User.find_by_email(params[:user][:email]);

        # If user doesnt exist, make them, and attach referrer
        if @user.nil?

            cur_ip = IpAddress.find_by_address(request.env['HTTP_X_FORWARDED_FOR'])

            if !cur_ip
                cur_ip = IpAddress.create(
                    :address => request.env['HTTP_X_FORWARDED_FOR'],
                    :count => 0
                )
            end

            if cur_ip.count > 2
                return redirect_to root_path
            else
                cur_ip.count = cur_ip.count + 1
                cur_ip.save
            end

            @user = User.new(:email => params[:user][:email])
          puts params[:user]
            @referred_by = User.find_by_referral_code(cookies[:h_ref])


            @user.save
            if params[:user][:referral_code] && params[:user][:referral_code] != ''
                @find_user = User.where(:referral_code => params[:user][:referral_code]).first
                @refer_count = Refers.where(:refer_by => @find_user.id)
                @total_refer = @refer_count.length

SELECT "promocodes".* FROM "promocodes" WHERE "promocodes"."userid" = 34
---
                end

                @pcode = SecureRandom.hex(5)
                @ucount = Promocodes.where(:userid => @find_user.id)

UPDATE "promocodes" SET "invited_users" = 4, "promo_code" = '60e714f48e', "code_price" = 0 WHERE "promocodes"."userid" = 34
INSERT INTO "promocodes" ("code_price", "created_at", "integer", "invited_users", "promo_code", "updated_at", "userid") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "refers" ("created_at", "refer_by", "updated_at", "userid") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 12 Nov 2015 21:10:03 UTC +00:00], ["refer_by", nil], ["updated_at", Thu, 12 Nov 2015 21:10:03 UTC +00:00], ["userid", nil]]
---
                puts @mcount
               if @mcount > 0

                Promocodes.where('userid': @find_user.id).update_all(invited_users: @total_refer, promo_code: @pcode , code_price: @price)

               else
                 @promo = Promocodes.new(:userid => @find_user.id, :invited_users => @total_refer, :promo_code => @pcode, :code_price => @price)
                @promo.save

SELECT "users".* FROM "users" WHERE "users"."email" = 'randhir@betasoftsystems.com' LIMIT 1
SELECT "refers".* FROM "refers" WHERE "refers"."refer_by" = 7
---
    def refer
        email = cookies[:h_email]

        @bodyId = 'refer'
        @is_mobile = mobile_device?

        @user = User.find_by_email(email)

        @refer_count = Refers.where(:refer_by => @user.id)